var text = '{"data":[' +
		'{"numero": "0","imagem": "Não tem","titulo": "NÃO USE O VALOR 0 DO DATA.JSON","desc": "ESSA ORGANELA PROVAVELMENTE NÃO EXISTE NO RESTO DO DATA, verifique o index de problemas","sub1": "<h2></h2>","p1": " ","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " ","sub1": "<h2></h2>","p1": " ","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub3": "<h2></h2>","p4": " "},'+

		'{"numero": "1","imagem": "./imagem/Nucleo-celular.png","titulo": "Núcleo","desc": "<p>O núcleo é a região da célula onde se encontra o material genético dos organismos tanto unicelulares como multicelulares.O núcleo é o que caracteriza os organismos eucariontes e os diferencia dos procariontes que não possuem núcleo.</p>","sub1": "<h2>Nucléolos</h2>","p1": "<p>Os nucléolos são corpos densos e arredondados compostos de proteínas, com RNA e DNA associados.É nessa região do núcleo onde são fabricadas as moléculas de RNA ribossômico que se associam a certas proteínas para formar as subunidades que compõem os ribossomos.</p>","sub2": "<h2>Carioteca</h2>","p2": "<p>A membrana que envolve o núcleo é chamada de carioteca, tem natureza semelhante às restante membranas celulares, ou seja, dupla camada de lipídios e proteínas.A membrana mais externa está ligada ao retículo endoplasmático e muitas vezes possui ribossomos aderidos.No lado interno da membrana interior há uma rede de proteínas que ajudam na sustentação da carioteca e participam do processo de divisão celular, contribuindo para a fragmentação e reconstituição do núcleo.Existem poros na carioteca que são importantes para controlar a entrada e saída de substâncias.</p>","sub3": "<h2>Cromatina</h2>","p3": "<p>As moléculas de DNA associadas às proteínas histonas compõem a cromatina. A cromatina pode estar mais densa, mais enrolada, sendo chamada heterocromatina que se diferencia da região de consistência mais frouxa, a eucromatina.</p>","sub4": "<h2></h2>","p4": "&nbsp"},'+

		'{"numero": "2","imagem": "./imagem/Nucleo-celular.png","titulo": "Nucleo","desc": "<p>Armazena Dna e Rna</br>Sistese de Rna</p>","sub1": "<h2>repetida</h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "3","imagem": "./imagem/ribossomo.png","titulo": "Ribossomos","desc": "<p>Os ribossomos são uma estrutura celular que produz proteína. A proteína é necessária para muitas funções celulares, como reparar danos ou direcionar processos químicos.Os ribossomos podem ser encontrados flutuando dentro do citoplasma ou preso ao retículo endoplasmático e são encontradas em todos os tipos celulares. Cada ribossomo é composto por duas subunidades de tamanhos desiguais que são chamadas de maior e menor. Quando analisamos as duas subunidades juntas, verifica-se a presença de mais de 80 proteínas na sua composição.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "4","imagem": "./imagem/peroxissomo.png","titulo": "Peroxissomo","desc": "<p>Os peroxissomos exercem funções do peroxissomos é digerir algumas substâncias. Isso porque em seu interior estão armazenadas as enzimas oxidases e estão presente em ambas as células.Os peroxissomos são pequenas estruturas em formato arredondado os quais estão envoltos por uma membrana lipoproteica. Em seu interior contém enzimas oxidases, responsáveis pela oxidação de substâncias.</p>","sub1": "<h2>Catalase</h2>","p1": "<p>A catalase é uma enzima produzida por quase todos os organismos vivos. Ela é responsável pela decomposição do peróxido de hidrogênio.A catalase é encontrada na organela peroxissomos, presente em células animais e vegetais.</p>","sub2": "<h2>Enzimas</h2>","p2": "<p>As enzimas são proteínas que catalisam reações químicas as quais ocorrem em seres vivos.Elas aceleram a velocidade das reações, o que contribui para o metabolismo. Sem as enzimas, muitas reações seriam extremamente lentas.Durante a reação, as enzimas não mudam sua composição e também não são consumidas. Assim, elas podem participar várias vezes do mesmo tipo de reação, em um intervalo de tempo pequeno.Cada enzima é específica para um tipo de reação. Ou seja, elas atuam somente em um determinado composto e efetuam sempre o mesmo tipo de reação.</p>","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "5","imagem": "./imagem/reticulo-endoplasmatico-rugoso.png","titulo": "Retículo endoplasmático rugoso","desc": "<p>O retículo endoplasmático, quando associado aos ribossomos adquire uma aparência áspera, motivo pelo qual é chamado de rugoso ou granuloso. Está localizado no citoplasma, próximo ao núcleo, sendo a sua membrana uma continuação da membrana nuclear externa.A proximidade com o núcleo torna a síntese de proteínas mais eficiente, uma vez que o RER pode enviar rapidamente um sinal para o núcleo iniciar o processo de transcrição do DNA, e ainda quando há proteínas deformadas ou desdobradas .</p>","sub1": "<h2>Ribossomos</h2>","p1": "","sub2": "</p>Os ribossomos são uma estrutura celular que produz proteína. A proteína é necessária para muitas funções celulares, como reparar danos ou direcionar processos químicos.Os ribossomos podem ser encontrados flutuando dentro do citoplasma ou preso ao retículo endoplasmático e são encontradas em todos os tipos celulares. Cada ribossomo é composto por duas subunidades de tamanhos desiguais que são chamadas de maior e menor. Quando analisamos as duas subunidades juntas, verifica-se a presença de mais de 80 proteínas na sua composição.</p></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "6","imagem": "./imagem/reticulo-endoplasmatico-liso.png","titulo": "Retículo endoplasmático liso","desc": "<p>O Retículo endoplasmático liso não possui ribossomos ligados à sua membrana e por isso parece liso.A sua função é,basicamente, participar da produção de moléculas de lipídios, em especial fosfolipídios que irão compor a membrana das células. No entanto, dependendo do tipo de célula em que se encontra, o REL terá funções diferentes.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "7","imagem": "./imagem/vacuolo-digestivo-autofagico.png","titulo": "Complexo de golgi","desc": "<p>O Complexo de Golgi ou Aparelho de Golgi, ou ainda Complexo Golgiense, é uma organela das células eucariontes, composta de discos membranosos achatados e empilhados.Suas funções são modificar, armazenar e exportar proteínas sintetizadas no retículo endoplasmático rugoso e além disso, origina os lisossomos e os acrossomos dos espermatozoides.</p>","sub1": "<h2>Lisossomo</h2>","p1": "<p>Os lisossomos são estruturas esféricas delimitadas pela membrana formada por uma camada lipoproteica. Essas organelas contêm muitas enzimas que lhes permite degradar um grande número de substâncias.A função dos lisossomos é fazer a digestão intracelular, que pode ser por fagocitose ou autofagia.No Complexo de Golgi são formadas vesículas que se soltam originando os lisossomos primários. Esses lisossomos ficam no citoplasma até que a célula realize endocitose e englobe alguma partícula externa. Nesse processo, a partícula é interiorizada dentro de uma vesícula, chamada endossomo, que se funde com o lisossomo primário formando o lisossomo secundário, que é uma espécie de vacúolo digestivo.</p>","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "8","imagem": "./imagem/flagelo.png","titulo": "Flagelos","desc": "<p>Os flagelos possuem uma forma alongada, que se assemelha a um chicote.  A função primária dos flagelos é a motilidade dos organismos, possibilitando o movimento em meio líquido, mas é frequente assumirem outras funções, entre as quais assegurar a circulação de fluidos, encaminhar alimento, ou funcionar como organelos sensoriais que reagem à presença de determinados compostos químicos ou à temperatura no exterior da célula. Dada a heterogeneidade estrutural e as diferentes origens evolutivas, os flagelos são considerados como organelos definidos pela função e não pela estrutura. No corpo humano, os gametas masculinos são formados por flagelos.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "9","imagem": "./imagem/mitocondria.png","titulo": "Mitocôndria","desc": "<p>As mitocôndrias são organelas complexas presentes apenas em células eucarióticas.A sua função é produzir a maior parte da energia das células, através do processo chamado de respiração celular.O tamanho, a forma, a quantidade e a distribuição das mitocôndrias variam de acordo com o tipo de célula. Elas ainda possuem o seu próprio material genético.</p>","sub1": "<h2>Membrana externa</h2>","p1": "<p>Semelhante a de outras organelas, lisa é composta de lipídeos e proteínas chamadas de porinas, que controlam a entrada de moléculas, permitindo a passagem de algumas relativamente grandes.</p>","sub2": "<h2>Membrana interna</h2>","p2": "<p>É menos permeável e apresenta numerosas dobras, chamadas de cristas mitocondriais.</p>","sub3": "<h2>Matriz</h2>","p3": "<p>Na matriz são encontrados os ribossomos, organelas que produzem proteínas necessárias à mitocôndria. Eles são diferentes daqueles encontrados no citoplasma celular e mais parecidos com o das bactérias. Outra característica comum a bactérias e mitocôndrias é a presença de moléculas circulares de DNA.</p>","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "10","imagem": "./imagem/vacuolo-digestivo-autofagico.png","titulo": "Lisossomos","desc": "<p>Produzidos a partir do complexo de Golgi; Digestão intracelular;</br> Contêm aproximadamente 40 diferentes enzimas, ativas em pH 4,8(citoplasma tem pH neutro);</br> Função autofágica: digestão de partes da própria célula</br> Responsáveis pela regressão da cauda de girinos, do útero no pós-parto e pela reciclagem de organelas velhas;</br> Função heterofágica: digestão de materiais capturados por fagocitose epinocitose;</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "11","imagem": "./imagem/citoplasma.png","titulo": "REALOCADO PARA O 13","desc": "REALOCADO PARA O 13","sub1": "<h2>REALOCADO PARA O 13</h2>","p1": "REALOCADO PARA O 13","sub2": "<h2>Citoesqueleto</h2>","p2": "<p>E na região denominada citoesqueleto, está presente uma complexa estrutura de redes formadas por microtúbulos e microfilamentos, que podem ser compostos de moléculas de proteína ou de actina.</p>","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "12","imagem": "./imagem/centriolo.png","titulo": "Centríolo","desc": "<p>Os centríolos são organelas não envolvidas por membrana e que participam do processo de divisão celular.Estruturalmente, são constituídos por um total de nove trios de microtúbulos protéicos, que se organizam em cilindro e são autoduplicáveis no período que precede a divisão celular, migrando, logo a seguir, para os pólos opostos da célula. Estruturalmente, são constituídos por um total de nove trios de microtúbulos protéicos, que se organizam em cilindro.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "13","imagem": "./imagem/citoplasma.png","titulo": "Membrana plasmática","desc": "<p>A membrana plasmática, membrana celular ou plasmalema é um envoltório fino, poroso e microscópico que reveste as células dos seres procariontes e eucariontes.É uma estrutura semipermeável, responsável pelo transporte e seleção de substâncias que entram e saem da célula.</p>","sub1": "<h2>Citoplasma</h2>","p1": "<p>O citoplasma é a região da célula onde se encontra o núcleo e as organelas, além de outras estruturas com funções específicas. É constituído de substância fluida denominada citosol.</p>","sub2": "<h2>Citosol</h2>","p2": "<p>A região que é mais fluida chamada hialoplasma, é onde ficam mergulhadas muitas estruturas membranosas chamadas organelas citoplasmáticas, além de grânulos compostos de RNA e proteínas, os ribossomos.</p>","sub3": "<h2>Citoesqueleto</h2>","p3": "<p>E na região denominada citoesqueleto, está presente uma complexa estrutura de redes formadas por microtúbulos e microfilamentos, que podem ser compostos de moléculas de proteína ou de actina.</p>","sub4": "<h2> </h2>","p4": " "},'+

		'{"numero": "14","imagem": "./imagem/cloroplastos.png","titulo": "Cloroplasto","desc": "<p>Os cloroplastos são organelas presentes apenas em células de plantas e algas, nas regiões que ficam iluminadas. Possuem cor verde devido à presença de clorofila e são responsáveis pela realização da fotossíntese.<br/>Geralmente a forma do cloroplasto é arredondada e alongada, mas pode ter outros formatos. Possui membrana lipoproteica dupla, sendo que a mais interna das membranas forma lamelas, compostas por pilhas lamelares menores, cada uma como se fosse uma pequena bolsa achatada, chamada tilacoide. Os tilacoides são interligados e ficam empilhados, sendo o conjunto chamado granum.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "15","imagem": "./imagem/vacuolo-digestivo-autofagico.png","titulo": "Vacúolo","desc": "<p>Os vacúolos são estruturas celulares envolvidas por membrana plasmática, muito comuns em plantas e presentes também em protozoários e animais. Tem diferentes funções como: regular pH, controlar a entrada e saída de água por osmorregulação, armazenar substâncias, fazer a digestão e excretar os resíduos.</p>","sub1": "<h2>Vacúolo de suco celular</h2>","p1": "<p>É o tipo encontrado nas células vegetais e geralmente é chamado apenas de vacúolo. Essa estrutura, assim como a presença de parede celular e plastos, constitui uma importante diferença entre as células animais e vegetais. Os vacúolos de suco celular são delimitados por uma membrana simples chamada de tonoplasto ou membrana vacuolar. No interior dos vacúolos, encontra-se uma solução de pH ácido formada por substâncias dissolvidas em água (açúcares, proteínas, compostos fenólicos, pigmentos e sais) que é conhecida como suco vacuolar ou suco celular.</p>","sub2": "<h2>Vacúolo digestórios</h2>","p2": "<p>Os vacúolos digestórios, diferente dos de suco celular, não são exclusivos das células vegetais, são responsáveis pela digestão intracelular e surgem do processo de endocitose, no qual o alimento é capturado pela célula e forma o pinossomo ou fagossomo, que nada mais é do que um vacúolo com alimento em seu interior. Um lisossomo então se une a essa estrutura e forma um vacúolo digestório. Um tipo especial de vacúolo digestivo é o <b>vacúolo autofágico</b>. Ele recebe essa denominação porque sua função é digerir estruturas da própria célula. Normalmente essas estruturas são organelas velhas que terão seus componentes reaproveitados.</p>","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "16","imagem": "./imagem/parede-celular.png","titulo": "Parede celular","desc": "<p>A parede celular é uma camada muito resistente, flexível e ocasionalmente rígida. Está presente em células vegetais, bactérias e fungos. As células animais não possuem parede celular. A parede celular envolve a membrana celular e fornece à célula suporte estrutural e proteção. Além disso, ela atua como filtro para a célula. Uma das principais funções da parede celular é atuar como vaso de pressão, evitando a Citólise (morte da célula) quando água entra na célula.</p>","sub1": "<h2>Plasmodesmos</h2>","p1": "<p>Apenas as células vegetais possuem plasmodesmos, que são formados entre células irmãs durante a citocinese, ao término da divisão celular. Cada um desses canais é constituído de cordões de citoplasma e de uma porção do retículo endoplasmático denominado desmotúbulo, que permite a comunicação entre os retículos de ambas as células interligadas. Os plasmodesmos, geralmente, se localizam no campo primário de pontoação, que é a área mais delgada da parede primária da célula vegetal.</p>","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "17","imagem": "./imagem/citoesqueleto.png","titulo": "Microtúbulo","desc": "<p>Microtúbulos são estruturas proteicas que fazem parte do citoesqueleto nas células</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "18","imagem": "./imagem/citoesqueleto.png","titulo": "Citoesqueleto","desc": "<p>Constituído de túbulos (microtúbulos) e filamentos (filamentos intermediários e microfilamentos) proteicos;</br>Funções:</br>– define a forma e organiza a estrutura interna da célula;</br>– permite a adesão da célula às vizinhas;</br>– possibilita o deslocamento de materiais dentro da célula;</br>– responsável pelo movimento ameboide, ciclose, contração muscular,movimentação dos cromossomos na divisão celular, movimento decílios e flagelos;</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub3": "<h2></h2>","p4": " "},'+

		'{"numero": "19","imagem": "./imagem/pilus.png","titulo": "Pilus","desc": "<p>São microfibrilas proteicas que se estendem da parede celular em muitas espécies</br>Função:</br>-Ancoramento da bactéria ao seu meio e são importantes na patogênese</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "20","imagem": "./imagem/capsula.png","titulo": "Capsula","desc": "<p>A cápsula bacteriana é uma estrutura grande presente em algumas células procariotas. É uma camada rígida com bordas bem definidas, formada por uma série de polímeros orgânicos. Ela se deposita no exterior da parede celular bacteriana.<br/>A cápsula bacteriana é considerada um fator de virulência pois aumenta a habilidade de uma bactéria causar doença. A cápsula protege a célula bacteriana contra a fagocitose por células eucarióticas como os macrófagos. Um anticorpo específico para a cápsula pode ser necessário para que a fagocitose ocorra. A cápsula também contém água, o que protege a bactéria da desidratação. Confere também proteção contra o ataque de bacteriófagos e a maioria dos materiais hidrofóbicos, como detergentes. Além disso, a cápsula ajuda na adesão da bactéria às células do hospedeiro.</p>","sub1": "<h2></h2>","p1": "","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "21","imagem": "./imagem/nucleiode.png","titulo": "Nucleoide","desc": "<p>Nucleoide é a região onde está localizado o material genético dos organismos procariontes. Essa estrutura pode ser esférica, alongada ou apresentar formato de halteres. O nucleoide compõe-se do genoma condensado, que forma, em bactérias, o chamado cromossomo bacteriano. O genoma apresenta, geralmente, uma única molécula de DNA em fita dupla, circular e capaz de autoduplicação.</p>","sub1": "<h2>Ribossomos</h2>","p1": "</p>Os ribossomos são uma estrutura celular que produz proteína. A proteína é necessária para muitas funções celulares, como reparar danos ou direcionar processos químicos.Os ribossomos podem ser encontrados flutuando dentro do citoplasma ou preso ao retículo endoplasmático e são encontradas em todos os tipos celulares. Cada ribossomo é composto por duas subunidades de tamanhos desiguais que são chamadas de maior e menor. Quando analisamos as duas subunidades juntas, verifica-se a presença de mais de 80 proteínas na sua composição.","sub2": "<h2></h2>","p2": " ","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "},'+

		'{"numero": "22","imagem": "./imagem/vacuolo-digestivo-autofagico.png","titulo": "Vesicula","desc": "<p>As vesículas transportam ou digerem produtos celulares ou resíduos. A membrana que rodeia a vesícula é similar à da membrana plasmática, pelo que as vesículas podem facilmente fundir-se com a membrana plasmática e libertar o seu conteúdo para fora da célula. As vesículas podem também fundir-se com outros organelos da célula.Como o interior da vesícula está separado do citosol pela sua membrana, o interior pode ser diferente do ambiente citosólico. Graças a isso, as vesículas são a ferramenta básica celular para a organização das substâncias celulares.</p>","sub1": "<h2>Vesículas de transporte</h2>","p1": "<p>As vesículas de transporte podem transportar moléculas entre duas zonas do interior da célula, por exemplo, deslocam proteínas desde o retículo endoplasmático rugoso ao aparelho de Golgi. As proteínas de membrana e as proteínas para a secreção sintetizam-se nos ribossomas do retículo endoplasmático rugoso. A maioria dessas proteínas amadurecem no aparelho de Golgi antes de alcançarem o seu destino final, que pode ser um lisossoma, um peroxissoma ou o exterior da célula. Estas proteínas viajam no interior da célula dentro de vesículas de transporte.</p>","sub2": "<h2>Vesículas secretoras</h2>","p2": "<p>As vesículas secretoras contêm substâncias que devem ser secretadas para fora da célula. As células têm necessidade de excretar substâncias por vários motivos, nomeadamente a eliminação de resíduos ou a secreção de substâncias produzidas pela célula que desempenham uma função no organismo (hormônios, neurotransmissores, etc.), como acontece em células especializadas que armazenam esses produtos em vesículas secretoras e depois libertam-nos quando necessário.</p>","sub3": "<h2></h2>","p3": " ","sub4": "<h2></h2>","p4": " "}]}';
		
		function conteudo(i){
			obj = JSON.parse(text);
			document.getElementById("titulo").innerHTML =
			obj.data[i].titulo ;
			document.getElementById("desc").innerHTML =
			obj.data[i].desc;
			document.getElementById("sub1").innerHTML =
			obj.data[i].sub1;
			document.getElementById("p1").innerHTML =
			obj.data[i].p1;
			document.getElementById("sub2").innerHTML =
			obj.data[i].sub2;
			document.getElementById("p2").innerHTML =
			obj.data[i].p2;
			document.getElementById("sub3").innerHTML =
			obj.data[i].sub3;
			document.getElementById("p3").innerHTML =
			obj.data[i].p3;
			document.getElementById("sub4").innerHTML =
			obj.data[i].sub4;
			document.getElementById("p4").innerHTML =
			obj.data[i].p4;
			document.getElementById("image").src= obj.data[i].imagem;
			}